In [31]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [32]:
data = [['Adrian', 20],['Bethany', 23],['Chloe', 41]]
df = pd.DataFrame(data, columns=['Name', 'Age'], dtype=int)
df

      Name  Age
0   Adrian   20
1  Bethany   23
2    Chloe   41

In [33]:
new_dict = {'Name': ['Tom', 'Jane', 'Steve', 'Lucy'], 'Sales': [250, 300, 350, 400]}
df_dict = pd.DataFrame(new_dict)
df_dict

    Name  Sales
0    Tom    250
1   Jane    300
2  Steve    350
3   Lucy    400

In [34]:
df_dict_index = pd.DataFrame(new_dict, index=['rank1','rank2','rank3','rank4'])
df_dict_index

        Name  Sales
rank1    Tom    250
rank2   Jane    300
rank3  Steve    350
rank4   Lucy    400

In [35]:
dict_list = [{'Name': 'Tom', 'Sales': 250}, {'Name': 'Jan', 'Sales': 300}, {'Name': 'Steve', 'Sales': 350}]
df_dict_list = pd.DataFrame(dict_list)
df_dict_list

    Name  Sales
0    Tom    250
1    Jan    300
2  Steve    350

In [36]:
east = pd.Series([1000,1200], index=['q1', 'q2'])
west = pd.Series([1500,1200, 4000], index=['q1', 'q2', 'q3'])
east

q1    1000
q2    1200
dtype: int64

In [37]:
west

q1    1500
q2    1200
q3    4000
dtype: int64

In [38]:
df_region = pd.DataFrame({"East": east, "West": west})
df_region

      East  West
q1  1000.0  1500
q2  1200.0  1200
q3     NaN  4000

In [41]:
df_region['North'] = [2000, 3000, 1234]
df_region

      East  West  North
q1  1000.0  1500   2000
q2  1200.0  1200   3000
q3     NaN  4000   1234

In [42]:
df_region.fillna(0)

      East  West  North
q1  1000.0  1500   2000
q2  1200.0  1200   3000
q3     0.0  4000   1234

In [43]:
df_region.fillna(method='ffill')

      East  West  North
q1  1000.0  1500   2000
q2  1200.0  1200   3000
q3  1200.0  4000   1234

In [44]:
df_region.dropna()

      East  West  North
q1  1000.0  1500   2000
q2  1200.0  1200   3000

In [51]:
df_region.dropna(axis=1,how='any')

    West  North
q1  1500   2000
q2  1200   3000
q3  4000   1234

In [53]:
df_dup = DataFrame([['A', 1], ['B', 2], ['A', 1]])
df_dup

   0  1
0  A  1
1  B  2
2  A  1

In [54]:
df_dup.duplicated()

0    False
1    False
2     True
dtype: bool

In [55]:
df_dup.drop_duplicates(inplace=True)
df_dup

   0  1
0  A  1
1  B  2

In [56]:
df_region

      East  West  North
q1  1000.0  1500   2000
q2  1200.0  1200   3000
q3     NaN  4000   1234

In [57]:
df_region["East"]

q1    1000.0
q2    1200.0
q3       NaN
Name: East, dtype: float64

In [58]:
df_region.iloc[2]

East        NaN
West     4000.0
North    1234.0
Name: q3, dtype: float64

In [59]:
df_region.iloc[0,1]

1500

In [63]:
df_region.iloc[1:3]

      East  West  North
q2  1200.0  1200   3000
q3     NaN  4000   1234

In [64]:
df_region.loc["q2"]

East     1200.0
West     1200.0
North    3000.0
Name: q2, dtype: float64

In [66]:
df_region.loc[['q1', 'q3']]

      East  West  North
q1  1000.0  1500   2000
q3     NaN  4000   1234

In [67]:
df_region.loc[[False,True,False]]

      East  West  North
q2  1200.0  1200   3000

In [68]:
df_region[df_region["East"]>1100]

      East  West  North
q2  1200.0  1200   3000

In [69]:
df_region['East'] + df_region['West']

q1    2500.0
q2    2400.0
q3       NaN
dtype: float64

In [70]:
df_region.sum()

East     2200.0
West     6700.0
North    6234.0
dtype: float64